app/controllers/documents_controller.rb

  def index
    @documents = Document.all
---
SELECT * FROM "documents"

  def show
session[:_csrf_token] = nil
    @document = Document.find(params[:id])
---
SELECT * FROM "documents" WHERE ("documents"."id" = 75)

  def destroy
    @document = Document.find(params[:id])
    @document.destroy
    folder = Folder.find(params[:folder])
---
SELECT * FROM "documents" WHERE ("documents"."id" = 54)
DELETE FROM "documents" WHERE "id" = 54
SELECT * FROM "folders" WHERE ("folders"."id" = 3)