app/controllers/folders_controller.rb

  def index
    @folders = Folder.all
---
SELECT * FROM "folders"

  def show
    @folder = Folder.find(params[:id])
---
SELECT * FROM "folders" WHERE ("folders"."id" = 1)

  def edit
    @folder = Folder.find(params[:id])
---
SELECT * FROM "folders" WHERE ("folders"."id" = 13)

  def create
    @folder = Folder.new(params[:folder])

    respond_to do |format|
      if @folder.save
---
INSERT INTO "folders" ("name", "created_at", "updated_at") VALUES('chrome_production', '2011-08-25 08:49:22', '2011-08-25 08:49:22')

  def multiple_uploads
    @folder = Folder.find(params[:id])
---
SELECT * FROM "folders" WHERE ("folders"."id" = 1)

  def do_multiple_upload
   #hash_structure = params["folder"]["documents_attributes"]
   @folder = Folder.find(params[:id].to_i)
   @i = params[:i].to_i
#   params["folder"] = {}
#   params["folder"]["documents_attributes"] = {}
#   params["folder"]["documents_attributes"].merge!({"0" => {"file" => params[:file]}})
   puts "===----------------------#{params}"
   if params.has_key?(:asset)
   params[:asset].each do |data|
   @document = @folder.documents.build
   @document.tmp_upload_dir = "#{data['filepath']}_1"

   @document.file =  File.new(data[:filepath])
   # @document.fast_asset = data
    # detect Mime-Type (mime-type detection doesn't work in flash)
   # @document.file_content_type = data[:content_type]

    @document.save!
---
SELECT * FROM "folders" WHERE ("folders"."id" = 1)
INSERT INTO "documents" ("name", "created_at", "folder_id", "updated_at", "file_content_type", "file_file_size", "file_file_name", "file_updated_at") VALUES('Virendra negi', '2011-09-20 11:59:31', 15, '2011-09-20 11:59:31', '', 1208, 'application.html (2).erb', '2011-09-20 11:59:31')

  def destroy
    @folder = Folder.find(params[:id])
    @folder.destroy
---
SELECT * FROM "folders" WHERE ("folders"."id" = 2)
DELETE FROM "folders" WHERE "id" = 2