app/controllers/helps_controller.rb

SELECT * FROM "helps"
---
  def index
    @helps = Help.all

SELECT * FROM "helps" WHERE ("helps"."id" = 1)
---
  def show
    @help = Help.find(params[:id])

SELECT * FROM "helps" WHERE ("helps"."id" = 1)
---
  def edit
    @help = Help.find(params[:id])

INSERT INTO "helps" ("name", "created_at", "updated_at", "file_content_type", "file_file_size", "file_file_name", "file_updated_at", "content") VALUES('folder_index', '2011-09-21 15:18:07', '2011-09-21 15:18:07', NULL, NULL, NULL, NULL, '<p>
---
  def create
    @help = Help.new(params[:help])

    respond_to do |format|
      if @help.save

SELECT * FROM "helps" WHERE ("helps"."id" = 1)
UPDATE "helps" SET "updated_at" = '2011-09-21 15:41:56', "content" = '<table border="1" cellpadding="1" cellspacing="1" style="width: 200px; ">
---
  def update
    @help = Help.find(params[:id])

    respond_to do |format|
      if @help.update_attributes(params[:help])